<a href="https://colab.research.google.com/github/bghaendler/BJBS-AI-LAB/blob/master/Session_2_BJBS_AI_Lab_2020_Planning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<img width="600" src="https://raw.githubusercontent.com/bghaendler/BJBS-AI-LAB/master/img/BJBSAILogo.png" class="center">

# Planning

## 1. Introduction (7 Feb)

### Why AI
### Why BJBS AI Laboratory

## <img src="https://image.flaticon.com/icons/svg/395/395841.svg" width="20"> 2. Introduction to Python Programming for Data Science (28 Feb)

### Why Data Scientists Love Python? [link](https://www.cbtnuggets.com/blog/technology/data/why-data-scientists-love-python)

- The numbers don't lie. **According to recent studies**, Python is the preferred programming language for data scientists. 
- They need an 
  1. **easy-to-use language** that has 
  2. **decent library availability** and 
  3. **great community participation**.



#### Why Python is the Best

- Python has long been known as a **simple programming language** to pick up, from a syntax point of view, anyway. 
- Python also has an **active community with a vast selection of libraries and resources**. 
- The result? 
 - You have a programming platform that makes sense to use with emerging technologies like machine learning and data science.

- Professionals working with data science applications **don't want to be bogged down with complicated programming requirements**. 
 - They want to use programming languages like Python and Ruby to perform tasks hassle-free.
  - **Ruby** is excellent for performing tasks such as data cleaning and data munging, along with other data pre-processing tasks. 
  - However, it doesn't feature as many machine learning libraries as Python. 
  - This gives Python the edge when it comes to data science and machine learning

- Python also enables developers to roll out programs and get prototypes running, making the development process much **faster**. 
- Once a project is on its way to becoming an analytical tool or application, **it can be ported to more sophisticated languages such as Java or C if necessary**.

- Newer data scientists gravitate toward Python because of its ease of use, which makes it accessible. So popular in fact, a staggering 48 percent of data scientists with five or fewer years experience rated Python their preferred programming language.

- This number tapers off as the experience level increases and the analytics become more intensive. 
- Python has proven itself to be an **excellent starting point for data scientists**.

#### Why Data Science and Python Mesh Well

- Data science **involves extrapolating useful information from massive stores of statistics, registers, and data**. 
 - These data are usually unsorted and difficult to correlate with any meaningful accuracy. 
 - Machine learning can make connections between disparate datasets but requires serious computational sophistry and power.

- Python fills this need by being a general-purpose programming language. 
 - It allows you to create CSV output for easy data reading in a spreadsheet.   
 - Alternatively, more complicated file outputs that can be ingested by machine learning clusters for computation.

#### Consider the following example:

- Weather forecasts rely on past readings from a century's worth of weather records. 
- Machine learning can help make more accurate predictive models based on past weather events. 
- **Python can do this because it is lightweight and efficient at executing code**, but it is also multi-functional. Also, Python can support object-oriented, structured and functional programming styles, meaning it can find an application anywhere.

There are now over 70,000 libraries in the Python Package Index, and that number continues to grow. As previously mentioned, Python offers many libraries geared toward data science. A simple Google search reveals plenty of Top 10 Python libraries for data science lists. Arguably, the most popular data analysis library is an open source library called pandas. It is a high-performance set of applications that make data analysis in Python a much simpler task.  

No matter what scientists are looking to do with Python, be it predictive causal analytics or prescriptive analytics, Python has the toolset to perform a variety of powerful functions. It's no wonder why data scientists embraced Python.


#### Final thoughts

When you think that Python couldn't get any cooler (relatively speaking), you discover it's named after Monty Python's Flying Circus, a classic comedy series from the late 1960's to the mid-1970's. Python documentation is littered with comedic references to Monty Python.

Better yet, Python is still under development, meaning it receives regular updates and releases. So, you can rest assured that learning Python for data science is time well spent. As big data and machine learning become more common in business and government, the demand for more Python-skilled practitioners is set to rise.

### Python for Data Science [link](https://www.geeksforgeeks.org/python-for-data-science/)

- Python is **open source, interpreted, high level language and provides great approach for object-oriented programming**. 
 - It is one of the best language used by data scientist for various data science projects/application. 
 - Python provide great functionality to deal with **mathematics, statistics and scientific function**. 
 - It provides great libraries to deals with data science application.

- One of the main reasons why Python is widely used in the scientific and research communities is because of its ease of use and **simple syntax** which makes it easy to adapt for people who do not have an engineering background. It is also more suited for quick prototyping.

- According to engineers coming from academia and industry, deep learning frameworks available with Python APIs, in addition to the scientific packages have made Python incredibly productive and versatile. There has been a lot of evolution in deep learning Python frameworks and it’s rapidly upgrading.

- In terms of application areas, ML scientists prefer Python as well. 
 - When it comes to areas like building fraud detection algorithms and network security, developers leaned towards Java, while for applications like natural language processing (NLP) and sentiment analysis, developers opted for Python, because it provides large collection of libraries that help to solve complex business problem easily, build strong system and data application.

#### Following are some useful features of Python language:

- It uses the elegant syntax, hence the programs are **easier to read**.
- It is a **simple to access** language, which makes it easy to achieve the program working.
- The large standard library and community support.
- The interactive mode of Python makes its simple to test codes.
- In Python, it is also simple to extend the code by appending new modules that are implemented in other compiled language like C++ or C.
- Python is an expressive language which is possible to embed into applications to offer a programmable interface.
- Allows developer to run the code anywhere, including Windows, Mac OS X, UNIX, and Linux.
- It is free software in a couple of categories. It does not cost anything to use or download Pythons or to add it to the application.
Most Commonly used libraries for data science :

##### Numpy: 

- Numpy is Python library that provides mathematical function to handle large dimension array. It provides various method/function for Array, Metrics, and linear algebra.
- NumPy stands for Numerical Python. It provides lots of useful features for operations on n-arrays and matrices in Python. The library provides vectorization of mathematical operations on the NumPy array type, which enhance performance and speeds up the execution. It’s very easy to work with large multidimensional arrays and matrices using NumPy.


##### Pandas: 
- Pandas is one of the most popular Python library for data manipulation and analysis. 
- Pandas provide useful functions to manipulate large amount of structured data. Pandas provide easiest method to perform analysis. - It provide large data structures and manipulating numerical tables and time series data. Pandas is a perfect tool for data wrangling. 
- Pandas is designed for quick and easy data manipulation, aggregation, and visualization. 
- There two data structures in Pandas –
 - Series – It Handle and store data in one-dimensional data.
 - DataFrame – It Handle and store Two dimensional data.

#####Matplotlib: 

- Matplolib is another useful Python library for Data Visualization. 
- Descriptive analysis and visualizing data is very important for any organization. 
- Matplotlib provides various method to Visualize data in more effective way. 
- Matplotlib allows to quickly make line graphs, pie charts, histograms, and other professional grade figures. Using Matplotlib, one can customize every aspect of a figure. Matplotlib has interactive features like zooming and planning and saving the Graph in graphics format.

##### Scipy: 

- Scipy is another popular Python library for data science and scientific computing. 
- Scipy provides great functionality to scientific mathematics and computing programming. 
- SciPy contains sub-modules for optimization, linear algebra, integration, interpolation, special functions, FFT, signal and image processing, ODE solvers, Statmodel and other tasks common in science and engineering.

##### Scikit – learn: 

- Sklearn is Python library for machine learning. 
- Sklearn provides various algorithms and functions that are used in machine learning. 
- Sklearn is built on NumPy, SciPy, and matplotlib. 
- Sklearn provides easy and simple tools for data mining and data analysis. It provides a set of common machine learning algorithms to users through a consistent interface. Scikit-Learn helps to quickly implement popular algorithms on datasets and solve real-world problems.

### Data Analysis: Python vs Excel [link](https://cambridgespark.com/python-vs-excel/)

#### Introduction

- Excel has been a firm favourite for working professionals for many years and for good reason. 
 - It has a large number of capabilities and its **ease of use** has meant that it’s played a **critical role in all manners of business, education, finance and research**. 
- Enter Python. 
 - This programming language has gained traction over recent years. 
 - [One report](https://www.sigmarrecruitment.eu/blog/2019/01/the-most-in-demand-coding-languages-for-2019) states that the demand for Python skills, as a requisite in job postings, has increased by 27.6% in the last year and shows no signs of slowing down. 
 - It was initially built as a way to write scripts that ‘**automate the boring stuff**’, but over time Python has become a **leader in web development, data analysis and infrastructure management**.

#### Demand for Excel

- Microsoft Excel skills are still in [high-demand](https://www.goskills.com/Excel/Articles/Jobs-require-Excel). 
 - After 34 years, in this fast-changing tech world, the **spreadsheet software is still going strong**. 
 - The seasoned data analysis tool is still used a lot in the [financial sector](https://www.mytotalretail.com/article/6-reasons-why-excel-still-matters-in-the-workplace/) to organise and present large amounts of data. 
 - Excel has been developed and updated recently which means it boasts more user-friendly features and more effective functionalities for all businesses. 

- [According to Microsoft](https://medium.com/grid-spreadsheets-run-the-world/excel-vs-google-sheets-usage-nature-and-numbers-9dfa5d1cadbd), there are 1.2 billion people that own Excel, of which 800 million people currently use it. 
 - In comparison, it’s been estimated that the number of people that use Python is around [8.2 million people](https://www.zdnet.com/article/programming-languages-python-developers-now-outnumber-java-ones/). 
 The odds are that if someone you work with sends you a report, it will be in Excel, so it’s useful to know how to use it.

#### The time for change

- However, consultants and [IT experts](https://siliconangle.com/2019/06/27/120m-users-risk-serious-vulnerability-microsoft-excel/) have voiced their concerns over how fragile the spreadsheet software can be. Excel is working to overcome challenges such as: 
 - **Data Volume**: Companies, small and large, have most likely used Excel at some point in their development. However, as the organisations generate data, they find themselves dealing with an increasing number of spreadsheets, resulting in complex analytical issues. 
 - **Syntax Errors**: Excel has been considered notorious when copying and pasting data in specific cell ranges. This can create lots of errors when inputting formulas manually.
 - **Security Risks**: Companies have to be cautious about the kind of information that is stored in Excel sheets, in case of misuse and cyber attacks. Excel has some security policies that need to be addressed.

#### Python says, (“Hello, World!”).

- First released in 1991, Python has become one of the most ubiquitous programming languages out there. 
 - Although Python and Excel technically have different functionalities, Python has developed a **strong following as people have realised its capabilities and potential**. 
 - It’s been deemed as a **better data analysis tool** by many developers and the wider data science [community](https://www.datasciencecentral.com/profiles/blogs/why-excel-users-should-learn-python). 
- While Python **needs basic programming skills**, it has been looked upon as a prerequisite for many quantitative roles. 
 - Companies are looking to hire new candidates with Python skills with **at least beginner-level proficiency**. 
- Its avid practitioners, known as **Pythonistas**, have uploaded **145,000 custom-built software packages to an online repository**.  
 - These cover [everything](https://www.economist.com/graphic-detail/2018/07/26/python-is-becoming-the-worlds-most-popular-coding-language) from game development to astronomy and can be installed and inserted into a Python program in a matter of seconds. 
- This versatility means that the 
 - Central Intelligence Agency has used it for hacking, 
 - Google for crawling web pages, 
 - Pixar for producing movies and 
 - Spotify for recommending songs. 
- Some of the most popular packages harness “machine learning”, by crunching large quantities of data to pick out patterns that would otherwise be imperceptible.

#### So how popular is it?

- According to the ‘[Popularity of Programming Language](http://pypl.github.io/PYPL.html)’ index, Python is the world’s most popular language. 
 - It’s grown 18.7% in the last five years. 
 - With a popularity share of 29.21%, Python beats the closest competitor, Java, by 9.31%. 
 - Whilst these numbers might not be an accurate metric to measure value, consider that Uber, PayPal, Google, Facebook, Instagram, Netflix, Dropbox, and Reddit all use Python in their development and testing. 
 - Moreover, Python is also used extensively in robotics and embedded systems. 
- In 2012, [Stack Overflow](https://stackoverflow.com/), the largest and most trusted online community for developers, saw questions relating to Python account for less than 4%. 
 - Today, [over 10% of questions on the site are related to Python](https://qz.com/1408660/the-rise-of-python-as-seen-through-a-decade-of-stack-overflow/).

#### Income boost

- **Not only can it increase your productivity, but it can also have a positive impact on your income**. 
- The average salary in the UK for jobs that require Python as a skill is £57,075, compared to £37,504 for jobs using Excel. 
- This means that by learning Python, you can expect to earn a higher salary on average. It’s also a great way to future-proof your career by keeping your skillset up-to-date and relevant.

<img src="https://cambridgespark.com/wp-content/uploads/2019/09/Python-Growth-Projection-2.png">

#### Who can benefit from learning Python?

- Python is such a diverse tool that can be used in multiple applications in plenty of jobs. Some of the most interesting things that you can do with Python are: 

- **Automate the boring stuff**: 
 - Updating spreadsheets, renaming files, gathering and formatting data, check for spelling, automate excel reports using Python, and grammar mistakes and compiling reports. 
 - These are just a few examples.
- Build a **Bitcoin notification service** to see when might be a good time to purchase the highly talked about cryptocurrency. 
 - If Ethereum is more your thing, the code can be replicated for other currencies.
- **Mine data from Twitter** to build a sentiment analysis tool. 
 - This project would lead nicely into learning more about text processing and speech recognition.
- **Build a Blockchain **to use for almost any financial transaction. 

- Alex Zhivitov is a Data Analyst at TransferWise, who is currently hiring for Data Analysts that have experience with Python. 
 - In a recent interview, he spoke about the importance of learning Python over the use of Excel. 
 - His response was “**There are many tasks that you can use Excel or SQL to get the job done but Python allows you more freedom to build the tools yourself and easily cover the data pipeline of data analytics from start to finish**”.

#### Jobs that Python can benefit

- **Account Managers**, Accountants and anyone working with large datasets can benefit from learning and using Python. 
 - Programming knowledge will allow you to extract and manipulate data from multiple reports, to then, filter and detect any inconsistencies in the data on a very large scale, which would take you a long time if using Excel. 

- **Data Analysts** can benefit from learning Python as the majority of their work involves trawling through data and Python can help automate that process, saving ones time and effort. 
 - As mentioned earlier, TransferWise are hiring Data Analysts that have experience in Python. 
 - Alex described that “with Python, you can do so much more because of its general-purpose. 
 - It gives you the freedom to build tools for yourself and you can easily cover the entire pipeline of Data Analytics work from start to finish.”

- Good news if you work in **Marketing**: 
 - Python can help you too. It can help by automating data collection (SEO indexation, email and SMS responses, and trend information), automate SEO processes, monitor campaigns more effectively and automate customised error checks. 
 - The jobs you would generally go to Excel for, you can automate by writing simple Python code.

- **Journalism**: 
 - This is particularly relevant within journalism that uses data to tell stories. 
 - Those who know Python are in demand as they can rapidly sort through information, making them much more efficient when it comes to writing for deadlines.

#### What makes Python a better option?

- There are many things that Excel can do, and it’s a great tool for basic data analysis, however, Python allows you to do more in terms of analysis. Here are a few reasons…

##### Python for Data Analysis

- Python can handle** much larger volumes of data** and therefore analysis, and it forms a basic requirement for most data science teams. 
- It can **easily overcome mundane tasks and bring in automation**. - Furthermore, it has **better efficiency and scalability**. 
- Python is faster than Excel for data pipelines, automation and calculating complex equations and algorithms.

##### Python is free!

- Although no programming language costs money to use, Python is free in another sense: it’s open-source. This means that the code can be inspected and modified by anyone. Python is a progressive language that is constantly being developed, collaboratively, by a group of volunteers. Microsoft Excel costs around £100 to download for one license. For businesses (dependant on the number of employees) it could be thousands, and Excel is developed solely by Microsoft employees.

##### Leveraging the latest research

- Excel has a large user base that offers a wide variety of tips and tricks in an open forum. But the Python community does the same, and more. With its strong ethos of collaboration, academics and Data Scientists often publish and share their code. This means that the latest techniques developed in Python are available for free to the community.

##### Python Libraries

- A Python library is a collection of functions and methods that allows you to perform many actions without writing your code from scratch. 
 - This makes a Data Analyst’s work **more efficient** seeing as they don’t have to waste time on writing out code, instead, they can just import a library. 
 - Different libraries have different functionalities. 
  - For example, **TensorFlow** (developed by Google) is used for machine learning projects and SciKit Learn is a library used when working with complex datasets.

##### Integrations

- Python is referred to as a ‘glue’ language, which means that it is particularly useful for **connecting different scripts together and interact with different systems including different forms of databases** (e.g. SQL and NoSQL databases), **data formats** (JSON, Parquet etc) and **web services**. 
- The Python community also contributes to many packages that allow you to interact with a range of public APIs. This is often useful for Data Scientists given they have to read data from different places and process it.

##### Deep Learning and Machine Learning

- Python is the de **facto language of machine learning**. 
 - Researchers and Academics are all using Python for deep learning to create predictive and simulative models that find new insights into their data. 
 - Most notably, Google’s TensorFlow works mostly with Python.

##### Python is widely supported

- Python is backed by a large community of developers (8.2 million) and therefore has a strong support system. There are many tutorials covering Python concepts all over the web. Even Python programming experts can find guidance if necessary when working on complex problems. As mentioned earlier, Excel does have a many more people using the software, and it’s well supported online in tutorials and guides.

- Python is not only supported online but offline too, at conferences, meetups, hackathons and events around the world. PyCon 2019 in Cleveland, for example, had just shy of 4,000 attendees. PyCon is an international set of conferences, held at multiple locations around the world. They aim to bring together developers and data science enthusiasts to discuss and promote the Python programming language.

- Another is PyData, a leading conference which focuses on the community of users and developers of data analysis tools to share and learn together with chapters in cities all over the world. (PyData Cambridge will be running in November 2019). 

- In the business world, Python proficiency has been on the rise. Cambridge Spark CEO, Dr Raoul-Gabriel Urma had an interview with eFinancialCareers about the future for traders if they don’t learn Python. He said, “If you want to get an edge today, you need to create new strategies with Python. This is why all the traders at trading companies are increasing their Python proficiency.” Dr. Urma’s experience and knowledge in Python comes from his Masters in Engineering in computer science and a PhD in computer science from Cambridge University, he followed this by working with Google and Goldman Sachs before starting his own tech company.

#### Excel vs Python: Who wins?

- The evidence suggests that both the software tools have their places with certain jobs. 
 - Excel is a great entry level tool and is a quick and easy way to do some analysis. 
 - But for the modern era, with **large data sets** and more **complex analytics** and **automation**, Python provides the tools, techniques, and processing power that Excel in, many instances, lacks. 
 - After all, Python is more powerful, faster, capable of better data analysis and it benefits from a more inclusive, collaborative support system.

- **Python is a must-have skill for Data Analysts and now is the time to learn**. Alex Zhivotov, also commented “You can be a good Data Analyst without knowing Python but if you want to stand out above the rest, be a star data analyst and progress then you need to learn Python”.
- If you want to reap the benefits such as a higher salary, better career opportunities and keeping your skills relevant for the [fourth industrial revolution](https://www.weforum.org/focus/fourth-industrial-revolution), then learn Python.

### Excel vs Python: How to Do Common Data Analysis Tasks [link](https://www.dataquest.io/blog/excel-vs-python/)

#### Introduction

- In this tutorial, we’ll compare Excel and Python by looking at how to perform basic analysis tasks across both platforms.

- Excel is the most commonly used data analysis software in the world. 
 - Why? It’s easy to get the hang of and fairly powerful once you master it. 
 - In contrast, Python’s reputation is that it’s more difficult to use, though what you can do with it is once you’ve learned it is almost unlimited.

- But how do these two data analysis tools actually compare? 
 - Their reputations don’t really reflect reality. In this tutorial, we’ll take a look at some common data analysis tasks to demonstrate how accessible Python data analysis can be.

- This tutorial assumes you have an intermediate-level knowledge of Excel, including using formulas and pivot tables.

- We’ll be using the Python library pandas, which is designed facilitate data analysis in Python, but you don’t need any Python or pandas knowledge for this tutorial.

### Why Use Python vs Excel?

- Before we start, you might be wondering why Python is even worth considering. Why couldn’t you just keep using Excel?

- Even though Excel is great, **there are some areas that make a programming language like Python better for certain types of data analysis**. 
 - Here are some reasons from our post [9 Reasons Excel Users Should Consider Learning Programming](https://www.dataquest.io/blog/9-reasons-excel-users-should-consider-learning-programming/):

- You can read and work with almost any kind of data.
 - **Automated and repetitive** tasks are easier.
 - Working with **large data sets** is much faster and easier.
 - It’s easier for others to reproduce and **audit your work**.
 - **Finding and fixing errors** is easier.
 - Python is **open source**, so **you can see what’s behind the libraries you use**.
 - **Advanced statistics and machine learning capabilities**.
 - Advanced** data visualization capabilities**.
 - **Cross-platform stability** — your analysis can be run on any computer.
- To be clear, we don’t advocate leaving Excel behind – it’s a powerful tool with many uses! But as an Excel user, being able to also leverage the power of Python can save you hours of time and open up career advancement opportunities.

- It’s worth remembering the two tools can **work well in tandem**, and you may find that some tasks are best left in Excel, while others would benefit from the power, flexibility, and transparency that’s offered by Python.cv



### <img src="https://image.flaticon.com/icons/svg/395/395841.svg" width="20"> Common Excel Tasks Demonstrated in Pandas [link](https://pbpython.com/excel-pandas-comp.html)

#### Adding a Sum to a Row

The first task I’ll cover is summing some columns to add a total column.

We will start by importing our excel data into a pandas dataframe.

In [1]:
import pandas as pd
import numpy as np
df = pd.read_excel("https://pbpython.com/extras/excel-comp-data.xlsx")
df.head()

   account                         name  ...     Feb    Mar
0   211829   Kerluke, Koepp and Hilpert  ...   62000  35000
1   320563               Walter-Trantow  ...   45000  35000
2   648336   Bashirian, Kunde and Price  ...  120000  35000
3   109996  D'Amore, Gleichner and Bode  ...  120000  10000
4   121213                Bauch-Goldner  ...  120000  35000

[5 rows x 9 columns]

We want to add a total column to show total sales for Jan, Feb and Mar.

This is straightforward in Excel and in pandas. For Excel, I have added the formula `sum(G2:I2)` in column J. Here is what it looks like in Excel:

<img src="https://pbpython.com/images/excel-1.png">

Next, here is how we do it in pandas:

In [2]:
df["total"] = df["Jan"] + df["Feb"] + df["Mar"]
df.head()

   account                         name  ...    Mar   total
0   211829   Kerluke, Koepp and Hilpert  ...  35000  107000
1   320563               Walter-Trantow  ...  35000  175000
2   648336   Bashirian, Kunde and Price  ...  35000  246000
3   109996  D'Amore, Gleichner and Bode  ...  10000  175000
4   121213                Bauch-Goldner  ...  35000  317000

[5 rows x 10 columns]

Next, let’s get some totals and other values for each month. Here is what we are trying to do as shown in Excel:

As you can see, we added a `SUM(G2:G16)` in row 17 in each of the columns to get totals by month.

Performing column level analysis is easy in pandas. Here are a couple of examples.

In [3]:
df["Jan"].sum(), df["Jan"].mean(),df["Jan"].min(),df["Jan"].max()

(1462000, 97466.66666666667, 10000, 162000)

Now, we want to add a total by month and grand total. This is where pandas and Excel diverge a little. It is very simple to add totals in cells in Excel for each month. Because pandas need to maintain the integrity of the entire DataFrame, there are a couple more steps.

First, create a sum for the month and total columns.

In [4]:
sum_row=df[["Jan","Feb","Mar","total"]].sum()
sum_row

Jan      1462000
Feb      1507000
Mar       717000
total    3686000
dtype: int64

This is fairly intuitive however, if you want to add totals as a row, you need to do some minor manipulations.

We need to transpose the data and convert the Series to a DataFrame so that it is easier to concat onto our existing data. The `T` function allows us to switch the data from being row-based to column-based.

In [5]:
df_sum=pd.DataFrame(data=sum_row).T
df_sum

       Jan      Feb     Mar    total
0  1462000  1507000  717000  3686000

The final thing we need to do before adding the totals back is to add the missing columns. We use reindex to do this for us. The trick is to add all of our columns and then allow pandas to fill in the values that are missing.

In [6]:
df_sum=df_sum.reindex(columns=df.columns)
df_sum

   account  name  street  city  ...      Jan      Feb     Mar    total
0      NaN   NaN     NaN   NaN  ...  1462000  1507000  717000  3686000

[1 rows x 10 columns]

Now that we have a nicely formatted DataFrame, we can add it to our existing one using append

In [7]:
df_final=df.append(df_sum,ignore_index=True)
df_final.tail()

     account                          name  ...     Mar    total
11  231907.0                    Hahn-Moore  ...  162000   322000
12  242368.0  Frami, Anderson and Donnelly  ...   35000   317000
13  268755.0                   Walsh-Haley  ...   35000   210000
14  273274.0                 McDermott PLC  ...   70000   340000
15       NaN                           NaN  ...  717000  3686000

[5 rows x 10 columns]

#### Additional Data Transforms

For another example, let’s try to add a state abbreviation to the data set.

From an Excel perspective the easiest way is probably to add a new column, do a vlookup on the state name and fill in the abbreviation.

I did this and here is a snapshot of what the results looks like:
<img src="https://pbpython.com/images/excel-3.png">

You’ll notice that after performing the vlookup, there are some values that are not coming through correctly. That’s because we misspelled some of the states. Handling this in Excel would be really challenging (on big data sets).

Fortunately with pandas we have the full power of the python ecosystem at our disposal. In thinking about how to solve this type of messy data problem, I thought about trying to do some fuzzy text matching to determine the correct value.

Fortunately someone else has done a lot of work in this are. The [fuzzy wuzzy library](https://chairnerd.seatgeek.com/fuzzywuzzy-fuzzy-string-matching-in-python/) has some pretty useful functions for this type of situation. Make sure to get it and install it first.

The other piece of code we need is a state name to abbreviation mapping. Instead of trying to type it myself, a little googling found this code.

Get started by importing the appropriate fuzzywuzzy functions and define our state map dictionary.

In [8]:
!pip install fuzzywuzzy

Collecting fuzzywuzzy
  Downloading https://files.pythonhosted.org/packages/43/ff/74f23998ad2f93b945c0309f825be92e04e0348e062026998b5eefef4c33/fuzzywuzzy-0.18.0-py2.py3-none-any.whl
Installing collected packages: fuzzywuzzy
Successfully installed fuzzywuzzy-0.18.0

In [9]:
from fuzzywuzzy import fuzz
from fuzzywuzzy import process
state_to_code = {"VERMONT": "VT", "GEORGIA": "GA", "IOWA": "IA", "Armed Forces Pacific": "AP", "GUAM": "GU",
                 "KANSAS": "KS", "FLORIDA": "FL", "AMERICAN SAMOA": "AS", "NORTH CAROLINA": "NC", "HAWAII": "HI",
                 "NEW YORK": "NY", "CALIFORNIA": "CA", "ALABAMA": "AL", "IDAHO": "ID", "FEDERATED STATES OF MICRONESIA": "FM",
                 "Armed Forces Americas": "AA", "DELAWARE": "DE", "ALASKA": "AK", "ILLINOIS": "IL",
                 "Armed Forces Africa": "AE", "SOUTH DAKOTA": "SD", "CONNECTICUT": "CT", "MONTANA": "MT", "MASSACHUSETTS": "MA",
                 "PUERTO RICO": "PR", "Armed Forces Canada": "AE", "NEW HAMPSHIRE": "NH", "MARYLAND": "MD", "NEW MEXICO": "NM",
                 "MISSISSIPPI": "MS", "TENNESSEE": "TN", "PALAU": "PW", "COLORADO": "CO", "Armed Forces Middle East": "AE",
                 "NEW JERSEY": "NJ", "UTAH": "UT", "MICHIGAN": "MI", "WEST VIRGINIA": "WV", "WASHINGTON": "WA",
                 "MINNESOTA": "MN", "OREGON": "OR", "VIRGINIA": "VA", "VIRGIN ISLANDS": "VI", "MARSHALL ISLANDS": "MH",
                 "WYOMING": "WY", "OHIO": "OH", "SOUTH CAROLINA": "SC", "INDIANA": "IN", "NEVADA": "NV", "LOUISIANA": "LA",
                 "NORTHERN MARIANA ISLANDS": "MP", "NEBRASKA": "NE", "ARIZONA": "AZ", "WISCONSIN": "WI", "NORTH DAKOTA": "ND",
                 "Armed Forces Europe": "AE", "PENNSYLVANIA": "PA", "OKLAHOMA": "OK", "KENTUCKY": "KY", "RHODE ISLAND": "RI",
                 "DISTRICT OF COLUMBIA": "DC", "ARKANSAS": "AR", "MISSOURI": "MO", "TEXAS": "TX", "MAINE": "ME"}

/usr/local/lib/python3.6/dist-packages/fuzzywuzzy/fuzz.py:11: UserWarning: Using slow pure-python SequenceMatcher. Install python-Levenshtein to remove this warning
  warnings.warn('Using slow pure-python SequenceMatcher. Install python-Levenshtein to remove this warning')

Here are some example of how the fuzzy text matching function works.

In [10]:
process.extractOne("Minnesotta",choices=state_to_code.keys())

('MINNESOTA', 95)

In [0]:
process.extractOne("AlaBAMMazzz",choices=state_to_code.keys(),score_cutoff=80)

Now that we know how this works, we create our function to take the state column and convert it to a valid abbreviation. We use the 80 score_cutoff for this data. You can play with it to see what number works for your data. You’ll notice that we either return a valid abbreviation or an np.nan so that we have some valid values in the field.

In [0]:
def convert_state(row):
    abbrev = process.extractOne(row["state"],choices=state_to_code.keys(),score_cutoff=80)
    if abbrev:
        return state_to_code[abbrev[0]]
    return np.nan

Add the column in the location we want and fill it with NaN values

In [13]:
df.insert(6, "abbrev", np.nan)
df.head(16)

    account                              name  ...     Mar   total
0    211829        Kerluke, Koepp and Hilpert  ...   35000  107000
1    320563                    Walter-Trantow  ...   35000  175000
2    648336        Bashirian, Kunde and Price  ...   35000  246000
3    109996       D'Amore, Gleichner and Bode  ...   10000  175000
4    121213                     Bauch-Goldner  ...   35000  317000
5    132971  Williamson, Schumm and Hettinger  ...   35000  305000
6    145068                        Casper LLC  ...   70000  252000
7    205217                  Kovacek-Johnston  ...   35000  275000
8    209744                    Champlin-Morar  ...   35000  200000
9    212303                    Gerhold-Maggio  ...   35000  225000
10   214098       Goodwin, Homenick and Jerde  ...   55000  220000
11   231907                        Hahn-Moore  ...  162000  322000
12   242368      Frami, Anderson and Donnelly  ...   35000  317000
13   268755                       Walsh-Haley  ...   35000  210000
14   273274                     McDermott PLC  ...   70000  340000

[15 rows x 11 columns]

We use apply to add the abbreviations into the approriate column.

In [14]:
df['abbrev'] = df.apply(convert_state, axis=1)
df.tail()

    account                          name  ...     Mar   total
10   214098   Goodwin, Homenick and Jerde  ...   55000  220000
11   231907                    Hahn-Moore  ...  162000  322000
12   242368  Frami, Anderson and Donnelly  ...   35000  317000
13   268755                   Walsh-Haley  ...   35000  210000
14   273274                 McDermott PLC  ...   70000  340000

[5 rows x 11 columns]

I think this is pretty cool. We have developed a very simple process to intelligently clean up this data. Obviously when you only have 15 or so rows, this is not a big deal. However, what if you had 15,000? You would have to do something manual in Excel to clean this up.

#### Subtotals

For the final section of this article, let’s get some subtotals by state.

In Excel, we would use the subtotal tool to do this for us.
<img src="https://pbpython.com/images/excel-4.png">

The output would look like this:

<img src="https://pbpython.com/images/excel-5.png">

Creating a subtotal in pandas, is accomplished using groupby

In [15]:
df_sub=df[["abbrev","Jan","Feb","Mar","total"]].groupby('abbrev').sum()
df_sub

           Jan     Feb     Mar   total
abbrev
AR      150000  120000   35000  305000
CA      162000  120000   35000  317000
DE      150000  120000   70000  340000
IA      253000  240000   70000  563000
ID       70000  120000   35000  225000
ME       45000  120000   10000  175000
MS       62000  120000   70000  252000
NC       95000   45000   35000  175000
ND      150000   10000  162000  322000
PA       70000   95000   35000  200000
RI      200000  215000   70000  485000
TN       45000  120000   55000  220000
TX       10000   62000   35000  107000

Next, we want to format the data as currency by using applymap to all the values in the data frame.

In [16]:
def money(x):
    return "${:,.0f}".format(x)

formatted_df = df_sub.applymap(money)
formatted_df

             Jan       Feb       Mar     total
abbrev
AR      $150,000  $120,000   $35,000  $305,000
CA      $162,000  $120,000   $35,000  $317,000
DE      $150,000  $120,000   $70,000  $340,000
IA      $253,000  $240,000   $70,000  $563,000
ID       $70,000  $120,000   $35,000  $225,000
ME       $45,000  $120,000   $10,000  $175,000
MS       $62,000  $120,000   $70,000  $252,000
NC       $95,000   $45,000   $35,000  $175,000
ND      $150,000   $10,000  $162,000  $322,000
PA       $70,000   $95,000   $35,000  $200,000
RI      $200,000  $215,000   $70,000  $485,000
TN       $45,000  $120,000   $55,000  $220,000
TX       $10,000   $62,000   $35,000  $107,000

The formatting looks good, now we can get the totals like we did earlier.

In [17]:
sum_row=df_sub[["Jan","Feb","Mar","total"]].sum()
sum_row

Jan      1462000
Feb      1507000
Mar       717000
total    3686000
dtype: int64

Convert the values to columns and format it.

In [18]:
df_sub_sum=pd.DataFrame(data=sum_row).T
df_sub_sum=df_sub_sum.applymap(money)
df_sub_sum

          Jan         Feb       Mar       total
0  $1,462,000  $1,507,000  $717,000  $3,686,000

Finally, add the total value to the DataFrame.

In [19]:
final_table = formatted_df.append(df_sub_sum)
final_table

           Jan         Feb       Mar       total
AR    $150,000    $120,000   $35,000    $305,000
CA    $162,000    $120,000   $35,000    $317,000
DE    $150,000    $120,000   $70,000    $340,000
IA    $253,000    $240,000   $70,000    $563,000
ID     $70,000    $120,000   $35,000    $225,000
ME     $45,000    $120,000   $10,000    $175,000
MS     $62,000    $120,000   $70,000    $252,000
NC     $95,000     $45,000   $35,000    $175,000
ND    $150,000     $10,000  $162,000    $322,000
PA     $70,000     $95,000   $35,000    $200,000
RI    $200,000    $215,000   $70,000    $485,000
TN     $45,000    $120,000   $55,000    $220,000
TX     $10,000     $62,000   $35,000    $107,000
0   $1,462,000  $1,507,000  $717,000  $3,686,000

You’ll notice that the index is ‘0’ for the total line. We want to change that using rename .

In [20]:
final_table = final_table.rename(index={0:"Total"})
final_table

              Jan         Feb       Mar       total
AR       $150,000    $120,000   $35,000    $305,000
CA       $162,000    $120,000   $35,000    $317,000
DE       $150,000    $120,000   $70,000    $340,000
IA       $253,000    $240,000   $70,000    $563,000
ID        $70,000    $120,000   $35,000    $225,000
ME        $45,000    $120,000   $10,000    $175,000
MS        $62,000    $120,000   $70,000    $252,000
NC        $95,000     $45,000   $35,000    $175,000
ND       $150,000     $10,000  $162,000    $322,000
PA        $70,000     $95,000   $35,000    $200,000
RI       $200,000    $215,000   $70,000    $485,000
TN        $45,000    $120,000   $55,000    $220,000
TX        $10,000     $62,000   $35,000    $107,000
Total  $1,462,000  $1,507,000  $717,000  $3,686,000

#### Another example

Load in the Excel data that represents a year’s worth of sales for our sample company.

In [21]:
df = pd.read_excel("https://github.com/chris1610/pbpython/blob/master/data/sample-salesv3.xlsx?raw=true")
df.dtypes

account number      int64
name               object
sku                object
quantity            int64
unit price        float64
ext price         float64
date               object
dtype: object

In [22]:
df.head()

   account number                         name  ... ext price                 date
0          740150                   Barton LLC  ...   3380.91  2014-01-01 07:21:51
1          714466              Trantow-Barrows  ...    -63.16  2014-01-01 10:00:47
2          218895                    Kulas Inc  ...   2086.10  2014-01-01 13:24:58
3          307599  Kassulke, Ondricka and Metz  ...    863.05  2014-01-01 15:05:22
4          412290                Jerde-Hilpert  ...    499.26  2014-01-01 23:26:55

[5 rows x 7 columns]

You’ll notice that our date column is showing up as a generic object . We are going to convert it to datetime object to make some future selections a little easier.

In [23]:
df['date'] = pd.to_datetime(df['date'])
df.head()

   account number                         name  ... ext price                date
0          740150                   Barton LLC  ...   3380.91 2014-01-01 07:21:51
1          714466              Trantow-Barrows  ...    -63.16 2014-01-01 10:00:47
2          218895                    Kulas Inc  ...   2086.10 2014-01-01 13:24:58
3          307599  Kassulke, Ondricka and Metz  ...    863.05 2014-01-01 15:05:22
4          412290                Jerde-Hilpert  ...    499.26 2014-01-01 23:26:55

[5 rows x 7 columns]

In [24]:
df.dtypes

account number             int64
name                      object
sku                       object
quantity                   int64
unit price               float64
ext price                float64
date              datetime64[ns]
dtype: object

The date is now a datetime object which will be useful in future steps.

#### Filtering the data

I think one of the handiest features in Excel is the filter. I imagine that almost anytime someone gets an Excel file of any size and they want to filter the data, they use this function.

Here is an image of using it for this data set:

<img src="https://pbpython.com/images/excel-filter.png">

Similar to the ilter function in Excel, you can use pandas to filter and select certain subsets of data.

For instance, if we want to just see a specific account number, we can easily do that with Excel or with pandas.

Here is the Excel filter solution:

<img src="https://pbpython.com/images/excel-filter2.png">

It is relatively straightforward to do in pandas. Note, I am going to use the head function to show the top results. This is purely for the purposes of keeping the article shorter.

In [25]:
df[df["account number"]==307599].head()

    account number                         name  ... ext price                date
3           307599  Kassulke, Ondricka and Metz  ...    863.05 2014-01-01 15:05:22
13          307599  Kassulke, Ondricka and Metz  ...    211.48 2014-01-04 07:53:01
34          307599  Kassulke, Ondricka and Metz  ...   1156.40 2014-01-10 05:26:31
58          307599  Kassulke, Ondricka and Metz  ...    833.14 2014-01-15 16:22:22
70          307599  Kassulke, Ondricka and Metz  ...   4258.76 2014-01-18 06:32:31

[5 rows x 7 columns]

You could also do the filtering based on numeric values. I am not going to show any more Excel-based samples. I am sure you get the idea.

In [26]:
df[df["quantity"] > 22].head()

    account number                          name  ... ext price                date
0           740150                    Barton LLC  ...   3380.91 2014-01-01 07:21:51
2           218895                     Kulas Inc  ...   2086.10 2014-01-01 13:24:58
3           307599   Kassulke, Ondricka and Metz  ...    863.05 2014-01-01 15:05:22
14          737550  Fritsch, Russel and Anderson  ...   1645.88 2014-01-04 08:57:48
15          239344                    Stokes LLC  ...   2431.34 2014-01-04 11:34:58

[5 rows x 7 columns]

If we want to do more complex filtering, we can use map to filter on various criteria. In this example, let’s look for items with sku’s that start with B1.

In [27]:
df[df["sku"].map(lambda x: x.startswith('B1'))].head()

    account number                          name  ... ext price                date
0           740150                    Barton LLC  ...   3380.91 2014-01-01 07:21:51
2           218895                     Kulas Inc  ...   2086.10 2014-01-01 13:24:58
6           218895                     Kulas Inc  ...     62.20 2014-01-02 10:57:23
14          737550  Fritsch, Russel and Anderson  ...   1645.88 2014-01-04 08:57:48
17          239344                    Stokes LLC  ...    227.22 2014-01-04 22:14:32

[5 rows x 7 columns]

It’s easy to chain two or more statements together using the &.

In [28]:
df[df["sku"].map(lambda x: x.startswith('B1')) & (df["quantity"] > 22)].head()

    account number                          name  ... ext price                date
0           740150                    Barton LLC  ...   3380.91 2014-01-01 07:21:51
2           218895                     Kulas Inc  ...   2086.10 2014-01-01 13:24:58
14          737550  Fritsch, Russel and Anderson  ...   1645.88 2014-01-04 08:57:48
26          737550  Fritsch, Russel and Anderson  ...   1766.52 2014-01-08 00:02:11
31          714466               Trantow-Barrows  ...    625.92 2014-01-09 10:16:32

[5 rows x 7 columns]

Another useful function that pandas supports is called isin . It allows us to define a list of values we want to look for.

In this case, we look for all records that include two specific account numbers.

In [29]:
df[df["account number"].isin([714466,218895])].head()

   account number             name  ... ext price                date
1          714466  Trantow-Barrows  ...    -63.16 2014-01-01 10:00:47
2          218895        Kulas Inc  ...   2086.10 2014-01-01 13:24:58
5          714466  Trantow-Barrows  ...   1489.71 2014-01-02 10:07:15
6          218895        Kulas Inc  ...     62.20 2014-01-02 10:57:23
8          714466  Trantow-Barrows  ...   1849.98 2014-01-03 11:29:02

[5 rows x 7 columns]

Pandas supports another function called query which allows you to efficiently select subsets of data. It does require the installation of numexpr so make sure you have it installed before trying this step.

If you would like to get a list of customers by name, you can do that with a query, similar to the python syntax shown above.

In [30]:
!pip install numexpr

Requirement already satisfied: numexpr in /usr/local/lib/python3.6/dist-packages (2.7.1)
Requirement already satisfied: numpy>=1.7 in /usr/local/lib/python3.6/dist-packages (from numexpr) (1.17.5)

In [31]:
df.query('name == ["Kulas Inc","Barton LLC"]').head()

    account number        name  ... ext price                date
0           740150  Barton LLC  ...   3380.91 2014-01-01 07:21:51
2           218895   Kulas Inc  ...   2086.10 2014-01-01 13:24:58
6           218895   Kulas Inc  ...     62.20 2014-01-02 10:57:23
33          218895   Kulas Inc  ...     67.08 2014-01-09 23:58:27
36          218895   Kulas Inc  ...   1168.64 2014-01-10 12:07:30

[5 rows x 7 columns]

The query function allows you do more than just this simple example but for the purposes of this discussion, I’m showing it so you are aware that it is out there for your needs.

#### Working with Dates

Using pandas, you can do complex filtering on dates. Before doing anything with dates, I encourage you to sort by the date column to make sure the results return what you are expecting.

In [32]:
df = df.sort_values('date')
df.head()

   account number                         name  ... ext price                date
0          740150                   Barton LLC  ...   3380.91 2014-01-01 07:21:51
1          714466              Trantow-Barrows  ...    -63.16 2014-01-01 10:00:47
2          218895                    Kulas Inc  ...   2086.10 2014-01-01 13:24:58
3          307599  Kassulke, Ondricka and Metz  ...    863.05 2014-01-01 15:05:22
4          412290                Jerde-Hilpert  ...    499.26 2014-01-01 23:26:55

[5 rows x 7 columns]

The python filtering syntax shown before works with dates.

In [33]:
df[df['date'] >='20140905'].head()

      account number  ...                date
1042          163416  ... 2014-09-05 01:52:32
1043          714466  ... 2014-09-05 06:17:19
1044          729833  ... 2014-09-05 08:54:41
1045          729833  ... 2014-09-05 16:33:15
1046          737550  ... 2014-09-06 08:59:08

[5 rows x 7 columns]

One of the really nice features of pandas is that it understands dates so it will allow us to do partial filtering. If we want to only look for data more recent than a specific month, we can do so.

In [34]:
df[df['date'] >='2014-03'].head()

     account number  ...                date
242          163416  ... 2014-03-01 16:07:40
243          527099  ... 2014-03-01 17:18:01
244          527099  ... 2014-03-01 18:53:09
245          737550  ... 2014-03-01 23:47:17
246          688981  ... 2014-03-02 01:46:44

[5 rows x 7 columns]

Of course, you can chain the criteria.

In [35]:
df[(df['date'] >='20140701') & (df['date'] <= '20140715')].head()

     account number  ...                date
778          737550  ... 2014-07-01 00:21:58
779          218895  ... 2014-07-01 00:52:38
780          163416  ... 2014-07-01 08:15:52
781          672390  ... 2014-07-01 11:12:13
782          642753  ... 2014-07-02 04:02:39

[5 rows x 7 columns]

Because pandas understands date columns, you can express the date value in multiple formats and it will give you the results you expect.

In [36]:
df[df['date'] >= 'Oct-2014'].head()

      account number  ...                date
1141          307599  ... 2014-10-01 10:56:32
1142          737550  ... 2014-10-01 16:17:24
1143          737550  ... 2014-10-01 22:28:49
1144          146832  ... 2014-10-02 00:31:01
1145          424914  ... 2014-10-02 02:48:26

[5 rows x 7 columns]

In [37]:
df[df['date'] >= '10-10-2014'].head()

      account number  ...                date
1174          257198  ... 2014-10-10 02:59:06
1175          740150  ... 2014-10-10 15:08:53
1176          146832  ... 2014-10-10 18:24:01
1177          257198  ... 2014-10-11 01:48:13
1178          737550  ... 2014-10-11 10:25:53

[5 rows x 7 columns]

When working with time series data, if we convert the data to use the date as as the index, we can do some more filtering variations.
Set the new index using set_index .

In [38]:
df2 = df.set_index(['date'])
df2.head()

                     account number  ... ext price
date                                 ...
2014-01-01 07:21:51          740150  ...   3380.91
2014-01-01 10:00:47          714466  ...    -63.16
2014-01-01 13:24:58          218895  ...   2086.10
2014-01-01 15:05:22          307599  ...    863.05
2014-01-01 23:26:55          412290  ...    499.26

[5 rows x 6 columns]

We can slice the data to get a range.

In [39]:
df2["20140101":"20140201"].head()

                     account number  ... ext price
date                                 ...
2014-01-01 07:21:51          740150  ...   3380.91
2014-01-01 10:00:47          714466  ...    -63.16
2014-01-01 13:24:58          218895  ...   2086.10
2014-01-01 15:05:22          307599  ...    863.05
2014-01-01 23:26:55          412290  ...    499.26

[5 rows x 6 columns]

Once again, we can use various date representations to remove any ambiguity around date naming conventions.

In [40]:
df2["2014-Jan-1":"2014-Feb-1"].head()

                     account number  ... ext price
date                                 ...
2014-01-01 07:21:51          740150  ...   3380.91
2014-01-01 10:00:47          714466  ...    -63.16
2014-01-01 13:24:58          218895  ...   2086.10
2014-01-01 15:05:22          307599  ...    863.05
2014-01-01 23:26:55          412290  ...    499.26

[5 rows x 6 columns]

In [41]:
df2["2014-Jan-1":"2014-Feb-1"].tail()

                     account number           name  ... unit price  ext price
date                                                ...
2014-01-31 22:51:18          383080       Will LLC  ...      80.17    3447.31
2014-02-01 09:04:59          383080       Will LLC  ...      33.69     235.83
2014-02-01 11:51:46          412290  Jerde-Hilpert  ...      21.12     232.32
2014-02-01 17:24:32          412290  Jerde-Hilpert  ...      35.99     107.97
2014-02-01 19:56:48          412290  Jerde-Hilpert  ...      78.90    1814.70

[5 rows x 6 columns]

In [42]:
df2["2014"].head()

                     account number  ... ext price
date                                 ...
2014-01-01 07:21:51          740150  ...   3380.91
2014-01-01 10:00:47          714466  ...    -63.16
2014-01-01 13:24:58          218895  ...   2086.10
2014-01-01 15:05:22          307599  ...    863.05
2014-01-01 23:26:55          412290  ...    499.26

[5 rows x 6 columns]

In [43]:
df2["2014-Dec"].head()

                     account number             name  ... unit price  ext price
date                                                  ...
2014-12-01 20:15:34          714466  Trantow-Barrows  ...      77.97     233.91
2014-12-02 20:00:04          146832     Kiehn-Spinka  ...      57.81    2138.97
2014-12-03 04:43:53          218895        Kulas Inc  ...      77.44    2323.20
2014-12-03 06:05:43          141962       Herman LLC  ...      26.12     522.40
2014-12-03 14:17:34          642753      Pollich LLC  ...      71.21    1352.99

[5 rows x 6 columns]

As you can see, there are a lot of options when it comes to sorting and filtering based on dates.

#### Additional String Functions

Pandas has support for vectorized string functions as well.

If we want to identify all the sku’s that contain a certain value, we can use str.contains . In this case, we know that the sku is always represented in the same way, so B1 only shows up in the front of the sku. You need to understand your data to make sure you are getting back what you expected.

In [44]:
df[df['sku'].str.contains('B1')].head()

    account number                          name  ... ext price                date
0           740150                    Barton LLC  ...   3380.91 2014-01-01 07:21:51
2           218895                     Kulas Inc  ...   2086.10 2014-01-01 13:24:58
6           218895                     Kulas Inc  ...     62.20 2014-01-02 10:57:23
14          737550  Fritsch, Russel and Anderson  ...   1645.88 2014-01-04 08:57:48
17          239344                    Stokes LLC  ...    227.22 2014-01-04 22:14:32

[5 rows x 7 columns]

We can string queries together and use sort to control how the data is ordered.

In [45]:
df[
   (df['sku'].str.contains('B1-531')) & 
   (df['quantity']>40)].sort_values(by=['quantity','name'],ascending=[0,1])

      account number  ...                date
684           642753  ... 2014-06-08 19:33:33
792           688981  ... 2014-07-04 21:42:22
176           383080  ... 2014-02-11 04:14:09
1213          604255  ... 2014-10-18 19:27:01
1215          307599  ... 2014-10-18 23:25:10
1128          714466  ... 2014-09-27 10:42:48
1001          424914  ... 2014-08-26 11:44:30

[7 rows x 7 columns]

#### Bonus Task

I frequently find myself trying to get a list of unique items in a long list within Excel. It is a multi-step process to do this in Excel but is fairly simple in pandas. Here is one way to do this using the Advanced Filter in Excel.

<img src="https://pbpython.com/images/excel-filter3.png">

In pandas, we use the unique function on a column to get the list.

In [46]:
df["name"].unique()

array(['Barton LLC', 'Trantow-Barrows', 'Kulas Inc',
       'Kassulke, Ondricka and Metz', 'Jerde-Hilpert', 'Koepp Ltd',
       'Fritsch, Russel and Anderson', 'Kiehn-Spinka', 'Keeling LLC',
       'Frami, Hills and Schmidt', 'Stokes LLC', 'Kuhn-Gusikowski',
       'Herman LLC', 'White-Trantow', 'Sanford and Sons', 'Pollich LLC',
       'Will LLC', 'Cronin, Oberbrunner and Spencer',
       'Halvorson, Crona and Champlin', 'Purdy-Kunde'], dtype=object)

If we wanted to include the account number, we could use drop_duplicates .

In [47]:
df.drop_duplicates(subset=["account number","name"]).head()

   account number                         name  ... ext price                date
0          740150                   Barton LLC  ...   3380.91 2014-01-01 07:21:51
1          714466              Trantow-Barrows  ...    -63.16 2014-01-01 10:00:47
2          218895                    Kulas Inc  ...   2086.10 2014-01-01 13:24:58
3          307599  Kassulke, Ondricka and Metz  ...    863.05 2014-01-01 15:05:22
4          412290                Jerde-Hilpert  ...    499.26 2014-01-01 23:26:55

[5 rows x 7 columns]

We are obviously pulling in more data than we need and getting some non-useful information, so select only the first and second columns using ix .

In [48]:
df.drop_duplicates(subset=["account number","name"]).iloc[:,[0,1]]

     account number                             name
0            740150                       Barton LLC
1            714466                  Trantow-Barrows
2            218895                        Kulas Inc
3            307599      Kassulke, Ondricka and Metz
4            412290                    Jerde-Hilpert
7            729833                        Koepp Ltd
9            737550     Fritsch, Russel and Anderson
10           146832                     Kiehn-Spinka
11           688981                      Keeling LLC
12           786968         Frami, Hills and Schmidt
15           239344                       Stokes LLC
16           672390                  Kuhn-Gusikowski
18           141962                       Herman LLC
20           424914                    White-Trantow
21           527099                 Sanford and Sons
30           642753                      Pollich LLC
37           383080                         Will LLC
51           257198  Cronin, Oberbrunner and Spencer
67           604255    Halvorson, Crona and Champlin
106          163416                      Purdy-Kunde

#### Combining Data From Multiple Excel Files [link](https://pbpython.com/excel-file-combine.html)

A common task for python and pandas is to automate the process of aggregating data from multiple files and spreadsheets.

This article will walk through the basic flow required to parse multiple Excel files, combine the data, clean it up and analyze it. The combination of python + pandas can be extremely powerful for these activities and can be a very useful alternative to the manual processes or painful VBA scripts frequently used in business settings today.

#### The Problem

Before, I get into the examples, here is a simple diagram showing the challenges with the common process used in businesses all over the world to consolidate data from multiple Excel files, clean it up and perform some analysis.

<img src="https://pbpython.com/images/Excel-File-Processing.png">

Python + pandas can be a great alternative that is much more scaleable and powerful.

<img src="https://pbpython.com/images/Excel-File-Processing-pandas.png">

By using a python script, you can develop a more streamlined and repeatable solution to your data processing needs. The rest of this article will show a simple example of how this process works. I hope it will give you ideas of how to apply these tools to your unique situation.

In [0]:
files = ['https://github.com/chris1610/pbpython/blob/master/data/sales-jan-2014.xlsx?raw=true',
'https://github.com/chris1610/pbpython/blob/master/data/sales-feb-2014.xlsx?raw=true',
'https://github.com/chris1610/pbpython/blob/master/data/sales-mar-2014.xlsx?raw=true']

In [50]:
all_data = pd.DataFrame()
for f in files:
    df = pd.read_excel(f)
    print(df.shape)
    all_data = all_data.append(df,ignore_index=True,sort=True)

(134, 7)
(108, 7)
(142, 7)

Now we have all the data in our all_data DataFrame. You can use describe to look at it and make sure you data looks good.

In [51]:
all_data.describe()

       account number    ext price    quantity  unit price
count      384.000000   384.000000  384.000000  384.000000
mean    478125.989583  1394.517344   24.372396   56.651406
std     220902.947401  1117.809743   14.373219   27.075883
min     141962.000000   -97.160000   -1.000000   10.210000
25%     257198.000000   482.745000   12.000000   32.612500
50%     424914.000000  1098.710000   23.500000   58.160000
75%     714466.000000  2132.260000   37.000000   80.965000
max     786968.000000  4590.810000   49.000000   99.730000

A lot of this data may not make much sense for this data set but I’m most interested in the count row to make sure the number of data elements makes sense. In this case, I see all the data rows I expect.

In [52]:
all_data.head()

   account number                 date  ...       sku unit price
0          740150  2014-01-01 07:21:51  ...  B1-20000      86.69
1          714466  2014-01-01 10:00:47  ...  S2-77896      63.16
2          218895  2014-01-01 13:24:58  ...  B1-69924      90.70
3          307599  2014-01-01 15:05:22  ...  S1-65481      21.05
4          412290  2014-01-01 23:26:55  ...  S2-34077      83.21

[5 rows x 7 columns]

It is not critical in this example but the best practice is to convert the date column to a date time object.

In [0]:
all_data['date'] = pd.to_datetime(all_data['date'])

#### Combining Data

Now that we have all of the data into one DataFrame, we can do any manipulations the DataFrame supports. In this case, the next thing we want to do is read in another file that contains the customer status by account. You can think of this as a company’s customer segmentation strategy or some other mechanism for identifying their customers.

First, we read in the data.

In [54]:
status = pd.read_excel("https://pbpython.com/extras/customer-status.xlsx")
status

    account number                             name  status
0           740150                       Barton LLC    gold
1           714466                  Trantow-Barrows  silver
2           218895                        Kulas Inc  bronze
3           307599      Kassulke, Ondricka and Metz  bronze
4           412290                    Jerde-Hilpert  bronze
5           729833                        Koepp Ltd  silver
6           146832                     Kiehn-Spinka  silver
7           688981                      Keeling LLC  silver
8           786968         Frami, Hills and Schmidt  silver
9           239344                       Stokes LLC    gold
10          672390                  Kuhn-Gusikowski  silver
11          141962                       Herman LLC    gold
12          424914                    White-Trantow  silver
13          527099                 Sanford and Sons  bronze
14          642753                      Pollich LLC  bronze
15          257198  Cronin, Oberbrunner and Spencer    gold

We want to merge this data with our concatenated data set of sales. Use panda’s merge function and tell it to do a left join which is similar to Excel’s vlookup function.

In [55]:
all_data_st = pd.merge(all_data, status, how='left')
all_data_st.head()

   account number                date  ext price  ...       sku  unit price  status
0          740150 2014-01-01 07:21:51    3380.91  ...  B1-20000       86.69    gold
1          714466 2014-01-01 10:00:47     -63.16  ...  S2-77896       63.16  silver
2          218895 2014-01-01 13:24:58    2086.10  ...  B1-69924       90.70  bronze
3          307599 2014-01-01 15:05:22     863.05  ...  S1-65481       21.05  bronze
4          412290 2014-01-01 23:26:55     499.26  ...  S2-34077       83.21  bronze

[5 rows x 8 columns]

This looks pretty good but let’s look at a specific account.

In [56]:
all_data_st[all_data_st["account number"]==737550].head()

    account number                date  ext price  ...       sku  unit price status
9           737550 2014-01-03 19:07:37    1146.88  ...  S2-82423       81.92    NaN
14          737550 2014-01-04 08:57:48    1645.88  ...  B1-53102       71.56    NaN
26          737550 2014-01-08 00:02:11    1766.52  ...  B1-53636       42.06    NaN
32          737550 2014-01-09 13:20:40     590.80  ...  S1-27722       29.54    NaN
42          737550 2014-01-11 23:47:36    1576.96  ...  S1-93683       71.68    NaN

[5 rows x 8 columns]

This account number was not in our status file, so we have a bunch of NaN’s. We can decide how we want to handle this situation. For this specific case, let’s label all missing accounts as bronze. Use the fillna function to easily accomplish this on the status column.

In [57]:
all_data_st['status'].fillna('bronze',inplace=True)
all_data_st.head()

   account number                date  ext price  ...       sku  unit price  status
0          740150 2014-01-01 07:21:51    3380.91  ...  B1-20000       86.69    gold
1          714466 2014-01-01 10:00:47     -63.16  ...  S2-77896       63.16  silver
2          218895 2014-01-01 13:24:58    2086.10  ...  B1-69924       90.70  bronze
3          307599 2014-01-01 15:05:22     863.05  ...  S1-65481       21.05  bronze
4          412290 2014-01-01 23:26:55     499.26  ...  S2-34077       83.21  bronze

[5 rows x 8 columns]

Check the data just to make sure we’re all good.

In [58]:
all_data_st[all_data_st["account number"]==737550].head()

    account number                date  ext price  ...       sku  unit price  status
9           737550 2014-01-03 19:07:37    1146.88  ...  S2-82423       81.92  bronze
14          737550 2014-01-04 08:57:48    1645.88  ...  B1-53102       71.56  bronze
26          737550 2014-01-08 00:02:11    1766.52  ...  B1-53636       42.06  bronze
32          737550 2014-01-09 13:20:40     590.80  ...  S1-27722       29.54  bronze
42          737550 2014-01-11 23:47:36    1576.96  ...  S1-93683       71.68  bronze

[5 rows x 8 columns]

Now we have all of the data along with the status column filled in. We can do our normal data manipulations using the full suite of pandas capability.

#### Using Categories

First, we typecast it the column to a category using astype .

In [0]:
all_data_st["status"] = all_data_st["status"].astype("category")

This doesn’t immediately appear to change anything yet.

In [60]:
all_data_st.head()

   account number                date  ext price  ...       sku  unit price  status
0          740150 2014-01-01 07:21:51    3380.91  ...  B1-20000       86.69    gold
1          714466 2014-01-01 10:00:47     -63.16  ...  S2-77896       63.16  silver
2          218895 2014-01-01 13:24:58    2086.10  ...  B1-69924       90.70  bronze
3          307599 2014-01-01 15:05:22     863.05  ...  S1-65481       21.05  bronze
4          412290 2014-01-01 23:26:55     499.26  ...  S2-34077       83.21  bronze

[5 rows x 8 columns]

In [61]:
all_data_st.dtypes

account number             int64
date              datetime64[ns]
ext price                float64
name                      object
quantity                   int64
sku                       object
unit price               float64
status                  category
dtype: object

Categories get more interesting when you assign order to the categories. Right now, if we call sort on the column, it will sort alphabetically.

In [62]:
all_data_st.sort_values(by=["status"]).head()

     account number                date  ...  unit price  status
102          218895 2014-01-22 23:49:39  ...       49.59  bronze
187          412290 2014-02-13 12:35:26  ...       43.17  bronze
279          527099 2014-03-09 19:13:20  ...       95.17  bronze
114          163416 2014-01-26 20:08:00  ...       85.87  bronze
115          737550 2014-01-27 01:59:54  ...       19.14  bronze

[5 rows x 8 columns]

We use set_categories to tell it the order we want to use for this category object. In this case, we use the Olympic medal ordering.

In [0]:
all_data_st["status"].cat.set_categories([ "gold","silver","bronze"],inplace=True)

Now, we can sort it so that gold shows on top.

In [64]:
all_data_st.sort_values(by=["status"]).head()

     account number                date  ext price  ...       sku  unit price status
0            740150 2014-01-01 07:21:51    3380.91  ...  B1-20000       86.69   gold
204          141962 2014-02-18 13:55:44    1116.28  ...  B1-33364       25.37   gold
202          740150 2014-02-17 17:12:16    1380.74  ...  B1-38851       81.22   gold
197          257198 2014-02-15 17:27:44     285.88  ...  S1-27722       10.21   gold
195          740150 2014-02-15 07:45:16    2278.92  ...  B1-20000       81.39   gold

[5 rows x 8 columns]

#### Analyze Data

The final step in the process is to analyze the data. Now that it is consolidated and cleaned, we can see if there are any insights to be learned.

In [65]:
all_data_st["status"].describe()

count        384
unique         3
top       bronze
freq         172
Name: status, dtype: object

For instance, if you want to take a quick look at how your top tier customers are performaing compared to the bottom. Use groupby to get the average of the values.

In [66]:
all_data_st.groupby(["status"])["quantity","unit price","ext price"].mean()

         quantity  unit price    ext price
status
gold    24.375000   53.723889  1351.944583
silver  22.842857   57.272714  1320.032214
bronze  25.616279   57.371163  1472.965930

Of course, you can run multiple aggregation functions on the data to get really useful information

In [67]:
all_data_st.groupby(["status"])["quantity","unit price","ext price"].agg([np.sum,np.mean, np.std])

       quantity                        ...  ext price
            sum       mean        std  ...        sum         mean          std
status                                 ...
gold       1755  24.375000  14.575145  ...   97340.01  1351.944583  1182.657312
silver     3198  22.842857  14.512843  ...  184804.51  1320.032214  1086.384051
bronze     4406  25.616279  14.136071  ...  253350.14  1472.965930  1116.683843

[3 rows x 9 columns]

So, what does this tell you? Well, the data is completely random but my first observation is that we sell more units to our bronze customers than gold. Even when you look at the total dollar value associated with bronze vs. gold, it looks odd that we sell more to bronze customers than gold.

Maybe we should look at how many bronze customers we have and see what is going on?

What I plan to do is filter out the unique accounts and see how many gold, silver and bronze customers there are.

I’m purposely stringing a lot of commands together which is not necessarily best practice but does show how powerful pandas can be. Feel free to review my previous article here and here to understand it better. Play with this command yourself to understand how the commands interact.

In [68]:
all_data_st.drop_duplicates(subset=["account number","name"]).groupby(["status"])["name"].count()

status
gold      4
silver    7
bronze    9
Name: name, dtype: int64

#### Pandas Pivot Table Explained [link](https://pbpython.com/pandas-pivot-table-explained.html)

##### Introduction

Most people likely have experience with pivot tables in Excel. Pandas provides a similar function called (appropriately enough) pivot_table.

As an added bonus, I’ve created a simple cheat sheet that summarizes the pivot_table. You can find it at the end of this post and I hope it serves as a useful reference. Let me know if it is helpful.

##### The Data

Read in the data

In [69]:
df = pd.read_excel("https://github.com/chris1610/pbpython/blob/master/data/salesfunnel.xlsx?raw=true")
df.head()

   Account                          Name  ...  Price     Status
0   714466               Trantow-Barrows  ...  30000  presented
1   714466               Trantow-Barrows  ...  10000  presented
2   714466               Trantow-Barrows  ...   5000    pending
3   737550  Fritsch, Russel and Anderson  ...  35000   declined
4   146832                  Kiehn-Spinka  ...  65000        won

[5 rows x 8 columns]

For convenience sake, let’s define the status column as a category and set the order we want to view.

This isn’t strictly required but helps us keep the order we want as we work through analyzing the data.

In [0]:
df["Status"] = df["Status"].astype("category")
df["Status"].cat.set_categories(["won","pending","presented","declined"],inplace=True)

##### Pivot the data
As we build up the pivot table, I think it’s easiest to take it one step at a time. Add items and check each step to verify you are getting the results you expect. Don’t be afraid to play with the order and the variables to see what presentation makes the most sense for your needs.

The simplest pivot table must have a dataframe and an index . In this case, let’s use the Name as our index.

In [71]:
pd.pivot_table(df,index=["Name"])

                              Account   Price  Quantity
Name
Barton LLC                     740150   35000  1.000000
Fritsch, Russel and Anderson   737550   35000  1.000000
Herman LLC                     141962   65000  2.000000
Jerde-Hilpert                  412290    5000  2.000000
Kassulke, Ondricka and Metz    307599    7000  3.000000
Keeling LLC                    688981  100000  5.000000
Kiehn-Spinka                   146832   65000  2.000000
Koepp Ltd                      729833   35000  2.000000
Kulas Inc                      218895   25000  1.500000
Purdy-Kunde                    163416   30000  1.000000
Stokes LLC                     239344    7500  1.000000
Trantow-Barrows                714466   15000  1.333333

In [72]:
pd.pivot_table(df,index=["Name","Rep","Manager"])

                                                          Account  ...  Quantity
Name                         Rep           Manager                 ...
Barton LLC                   John Smith    Debra Henley    740150  ...  1.000000
Fritsch, Russel and Anderson Craig Booker  Debra Henley    737550  ...  1.000000
Herman LLC                   Cedric Moss   Fred Anderson   141962  ...  2.000000
Jerde-Hilpert                John Smith    Debra Henley    412290  ...  2.000000
Kassulke, Ondricka and Metz  Wendy Yule    Fred Anderson   307599  ...  3.000000
Keeling LLC                  Wendy Yule    Fred Anderson   688981  ...  5.000000
Kiehn-Spinka                 Daniel Hilton Debra Henley    146832  ...  2.000000
Koepp Ltd                    Wendy Yule    Fred Anderson   729833  ...  2.000000
Kulas Inc                    Daniel Hilton Debra Henley    218895  ...  1.500000
Purdy-Kunde                  Cedric Moss   Fred Anderson   163416  ...  1.000000
Stokes LLC                   Cedric Moss   Fred Anderson   239344  ...  1.000000
Trantow-Barrows              Craig Booker  Debra Henley    714466  ...  1.333333

[12 rows x 3 columns]

This is interesting but not particularly useful. What we probably want to do is look at this by Manager and Rep. It’s easy enough to do by changing the index .

In [73]:
pd.pivot_table(df,index=["Manager","Rep"])

                              Account         Price  Quantity
Manager       Rep
Debra Henley  Craig Booker   720237.0  20000.000000  1.250000
              Daniel Hilton  194874.0  38333.333333  1.666667
              John Smith     576220.0  20000.000000  1.500000
Fred Anderson Cedric Moss    196016.5  27500.000000  1.250000
              Wendy Yule     614061.5  44250.000000  3.000000

You can see that the pivot table is smart enough to start aggregating the data and summarizing it by grouping the reps with their managers. Now we start to get a glimpse of what a pivot table can do for us.

For this purpose, the Account and Quantity columns aren’t really useful. Let’s remove it by explicitly defining the columns we care about using the values field.

In [74]:
pd.pivot_table(df,index=["Manager","Rep"],values=["Price"])

                                    Price
Manager       Rep
Debra Henley  Craig Booker   20000.000000
              Daniel Hilton  38333.333333
              John Smith     20000.000000
Fred Anderson Cedric Moss    27500.000000
              Wendy Yule     44250.000000

The price column automatically averages the data but we can do a count or a sum. Adding them is simple using aggfunc and np.sum .

In [75]:
pd.pivot_table(df,index=["Manager","Rep"],values=["Price"],aggfunc=np.sum)

                              Price
Manager       Rep
Debra Henley  Craig Booker    80000
              Daniel Hilton  115000
              John Smith      40000
Fred Anderson Cedric Moss    110000
              Wendy Yule     177000

aggfunc can take a list of functions. Let’s try a mean using the numpy mean function and len to get a count.

In [76]:
pd.pivot_table(df,index=["Manager","Rep"],values=["Price"],aggfunc=[np.mean,len])

                                     mean   len
                                    Price Price
Manager       Rep
Debra Henley  Craig Booker   20000.000000     4
              Daniel Hilton  38333.333333     3
              John Smith     20000.000000     2
Fred Anderson Cedric Moss    27500.000000     4
              Wendy Yule     44250.000000     4

If we want to see sales broken down by the products, the columns variable allows us to define one or more columns.

Columns vs. Values
I think one of the confusing points with the pivot_table is the use of columns and values . Remember, columns are optional - they provide an additional way to segment the actual values you care about. The aggregation functions are applied to the values you list.

In [77]:
pd.pivot_table(df,index=["Manager","Rep"],values=["Price"],
               columns=["Product"],aggfunc=[np.sum])

                                  sum
                                Price
Product                           CPU Maintenance Monitor Software
Manager       Rep
Debra Henley  Craig Booker    65000.0      5000.0     NaN  10000.0
              Daniel Hilton  105000.0         NaN     NaN  10000.0
              John Smith      35000.0      5000.0     NaN      NaN
Fred Anderson Cedric Moss     95000.0      5000.0     NaN  10000.0
              Wendy Yule     165000.0      7000.0  5000.0      NaN

The NaN’s are a bit distracting. If we want to remove them, we could use fill_value to set them to 0.

In [78]:
pd.pivot_table(df,index=["Manager","Rep"],values=["Price"],
               columns=["Product"],aggfunc=[np.sum],fill_value=0)

                                sum
                              Price
Product                         CPU Maintenance Monitor Software
Manager       Rep
Debra Henley  Craig Booker    65000        5000       0    10000
              Daniel Hilton  105000           0       0    10000
              John Smith      35000        5000       0        0
Fred Anderson Cedric Moss     95000        5000       0    10000
              Wendy Yule     165000        7000    5000        0

I think it would be useful to add the quantity as well. Add Quantity to the values list.

In [79]:
pd.pivot_table(df,index=["Manager","Rep"],values=["Price","Quantity"],
               columns=["Product"],aggfunc=[np.sum],fill_value=0)

                                sum              ...
                              Price              ... Quantity
Product                         CPU Maintenance  ...  Monitor Software
Manager       Rep                                ...
Debra Henley  Craig Booker    65000        5000  ...        0        1
              Daniel Hilton  105000           0  ...        0        1
              John Smith      35000        5000  ...        0        0
Fred Anderson Cedric Moss     95000        5000  ...        0        1
              Wendy Yule     165000        7000  ...        2        0

[5 rows x 8 columns]

What’s interesting is that you can move items to the index to get a different visual representation. Remove Product from the columns and add to the index .

In [80]:
pd.pivot_table(df,index=["Manager","Rep","Product"],
               values=["Price","Quantity"],aggfunc=[np.sum],fill_value=0)

                                            sum
                                          Price Quantity
Manager       Rep           Product
Debra Henley  Craig Booker  CPU           65000        2
                            Maintenance    5000        2
                            Software      10000        1
              Daniel Hilton CPU          105000        4
                            Software      10000        1
              John Smith    CPU           35000        1
                            Maintenance    5000        2
Fred Anderson Cedric Moss   CPU           95000        3
                            Maintenance    5000        1
                            Software      10000        1
              Wendy Yule    CPU          165000        7
                            Maintenance    7000        3
                            Monitor        5000        2

For this data set, this representation makes more sense. Now, what if I want to see some totals? margins=True does that for us.

In [81]:
pd.pivot_table(df,index=["Manager","Rep","Product"],
               values=["Price","Quantity"],
               aggfunc=[np.sum,np.mean],fill_value=0,margins=True)

                                            sum            mean
                                          Price Quantity  Price  Quantity
Manager       Rep           Product
Debra Henley  Craig Booker  CPU           65000        2  32500  1.000000
                            Maintenance    5000        2   5000  2.000000
                            Software      10000        1  10000  1.000000
              Daniel Hilton CPU          105000        4  52500  2.000000
                            Software      10000        1  10000  1.000000
              John Smith    CPU           35000        1  35000  1.000000
                            Maintenance    5000        2   5000  2.000000
Fred Anderson Cedric Moss   CPU           95000        3  47500  1.500000
                            Maintenance    5000        1   5000  1.000000
                            Software      10000        1  10000  1.000000
              Wendy Yule    CPU          165000        7  82500  3.500000
                            Maintenance    7000        3   7000  3.000000
                            Monitor        5000        2   5000  2.000000
All                                      522000       30  30705  1.764706

Let’s move the analysis up a level and look at our pipeline at the manager level. Notice how the status is ordered based on our earlier category definition.

In [82]:
pd.pivot_table(df,index=["Manager","Status"],values=["Price"],
               aggfunc=[np.sum],fill_value=0,margins=True)

                            sum
                          Price
Manager       Status
Debra Henley  won         65000
              pending     50000
              presented   50000
              declined    70000
Fred Anderson won        172000
              pending      5000
              presented   45000
              declined    65000
All                      522000

A really handy feature is the ability to pass a dictionary to the aggfunc so you can perform different functions on each of the values you select. This has a side-effect of making the labels a little cleaner.

In [83]:
pd.pivot_table(df,
               index=["Manager","Status"],
               columns=["Product"],
               values=["Quantity","Price"],
               aggfunc={"Quantity":len,"Price":np.sum},
               fill_value=0)

                          Price              ... Quantity
Product                     CPU Maintenance  ...  Monitor Software
Manager       Status                         ...
Debra Henley  won         65000           0  ...        0        0
              pending     40000       10000  ...        0        0
              presented   30000           0  ...        0        2
              declined    70000           0  ...        0        0
Fred Anderson won        165000        7000  ...        0        0
              pending         0        5000  ...        0        0
              presented   30000           0  ...        1        1
              declined    65000           0  ...        0        0

[8 rows x 8 columns]

You can provide a list of aggfunctions to apply to each value too:

In [84]:
table = pd.pivot_table(df,
                       index=["Manager","Status"],
                       columns=["Product"],
                       values=["Quantity","Price"],
                       aggfunc={
                           "Quantity":len,
                           "Price":[np.sum,np.mean]},
                       fill_value=0)
table

                         Price                      ...    Quantity
                          mean                      ...         len
Product                    CPU Maintenance Monitor  ... Maintenance Monitor Software
Manager       Status                                ...
Debra Henley  won        65000           0       0  ...           0       0        0
              pending    40000        5000       0  ...           2       0        0
              presented  30000           0       0  ...           0       0        2
              declined   35000           0       0  ...           0       0        0
Fred Anderson won        82500        7000       0  ...           1       0        0
              pending        0        5000       0  ...           1       0        0
              presented  30000           0    5000  ...           0       1        1
              declined   65000           0       0  ...           0       0        0

[8 rows x 12 columns]

It can look daunting to try to pull this all together at one time but as soon as you start playing with the data and slowly add the items, you can get a feel for how it works. My general rule of thumb is that once you use multiple grouby you should evaluate whether a pivot table is a useful approach.

##### Advanced Pivot Table Filtering

Once you have generated your data, it is in a DataFrame so you can filter on it using your standard DataFrame functions.

If you want to look at just one manager:

In [85]:
table.query('Manager == ["Debra Henley"]')

                        Price                      ...    Quantity
                         mean                      ...         len
Product                   CPU Maintenance Monitor  ... Maintenance Monitor Software
Manager      Status                                ...
Debra Henley won        65000           0       0  ...           0       0        0
             pending    40000        5000       0  ...           2       0        0
             presented  30000           0       0  ...           0       0        2
             declined   35000           0       0  ...           0       0        0

[4 rows x 12 columns]

We can look at all of our pending and won deals.

In [86]:
table.query('Status == ["pending","won"]')

                       Price                      ...    Quantity
                        mean                      ...         len
Product                  CPU Maintenance Monitor  ... Maintenance Monitor Software
Manager       Status                              ...
Debra Henley  won      65000           0       0  ...           0       0        0
              pending  40000        5000       0  ...           2       0        0
Fred Anderson won      82500        7000       0  ...           1       0        0
              pending      0        5000       0  ...           1       0        0

[4 rows x 12 columns]

his a poweful feature of the pivot_table so do not forget that you have the full power of pandas once you get your data into the pivot_table format you need.

<img src="https://pbpython.com/images/pivot-table-datasheet.png">

## 3. Data Science Methdology

## 4. SQL

## 5. Data Visualization (with Power BI / Tableau / Python)

## 6. Maths Foundations for AI

## 7. Artificial Intelligence (for non Programmers)

## 8. Machine Learning with Scikit

## 9. Web Scrapping

## 10. Deep Learning

## 11. Cloud Services (Azure, AWS, Google)

## 12. Tensorflow

## 13. Pytorch

## 14. FastAI

## 15. Reinforcement Learning